# To get started:
# * Install `Homebrew/brew`
# * Install `Homebrew/homebrew-bundle`
# * Install XCode from the Mac App Store
# * Run `brew bundle`


# Basic stuff.
brew 'git'
brew 'httpie'
brew 'jq'
brew 'openssl'
brew 'sl'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'zsh'

# Ruby
# brew 'ruby-build'
brew 'libyaml'

# Mac App Store.
brew 'mas'  # Requires iniital Xcode installation from App Store.

mas '1Password', id: 443987910
mas 'Clear', id: 504544917
mas 'DaisyDisk', id: 411643860
mas 'Fantastical 2', id: 975937182
mas 'Keynote', id: 409183694
mas 'Moom', id: 419330170
mas 'Name Mangler 3', id: 603637384
mas 'Numbers', id: 409203825
mas 'Omnifocus 2', id: 867299399
mas 'Pages', id: 409201541
mas 'Pixelmator', id: 407963104
mas 'Quiver', id: 866773894
mas 'Skitch', id: 425955336
mas 'Soulver', id: 413965349
mas 'TextWrangler', id: 404010395
mas 'Tweetbot', id: 557168941
